NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32MG24/EFR32MG24A110F1024IM48.svd
        <register>
          <name>INPUTCTRL</name>
          <description>No Description</description>
          <addressOffset>0x014</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x703FFFFF</resetMask>
          <fields>
            <field>
              <name>POSSEL</name>
              <description>Positive Input Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VSS</name>
                  <description>VSS</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VREFDIVAVDD</name>
                  <description>Divided AVDD</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VREFDIVAVDDLP</name>
                  <description>Low-Power Divided AVDD</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VREFDIV1V25</name>
                  <description>Divided 1V25 reference</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VREFDIV1V25LP</name>
                  <description>Low-power Divided 1V25 reference</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VREFDIV2V5</name>
                  <description>Divided 2V5 reference</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VREFDIV2V5LP</name>
                  <description>Low-power Divided 2V5 reference</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSENSE01DIV4</name>
                  <description>VSENSE0 divided by 4</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSENSE01DIV4LP</name>
                  <description>Low-power VSENSE0 divided by 4</description>
                  <value>33</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSENSE11DIV4</name>
                  <description>VSENSE1 divided by 4</description>
                  <value>34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSENSE11DIV4LP</name>
                  <description>Low-power VSENSE1 divided by 4</description>
                  <value>35</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDAC0OUT1</name>
                  <description>VDAC0 channel 1 output</description>
                  <value>65</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDAC1OUT1</name>
                  <description>VDAC1 channel 1 output</description>
                  <value>67</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTPA</name>
                  <description>External interface, base is PA0.</description>
                  <value>80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTPB</name>
                  <description>External interface, base is PB0.</description>
                  <value>81</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTPC</name>
                  <description>External interface, base is PC0.</description>
                  <value>82</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTPD</name>
                  <description>External interface, base is PD0.</description>
                  <value>83</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PA0</name>
                  <description>Port A, Pin0</description>
                  <value>128</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PA1</name>
                  <description>Port A, Pin1</description>
                  <value>129</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PA2</name>
                  <description>Port A, Pin2</description>
                  <value>130</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PA3</name>
                  <description>Port A, Pin3</description>
                  <value>131</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PA4</name>
                  <description>Port A, Pin4</description>
                  <value>132</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PA5</name>
                  <description>Port A, Pin5</description>
                  <value>133</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PA6</name>
                  <description>Port A, Pin6</description>
                  <value>134</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PA7</name>
                  <description>Port A, Pin7</description>
                  <value>135</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PA8</name>
                  <description>Port A, Pin8</description>
                  <value>136</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PA9</name>
                  <description>Port A, Pin9</description>
                  <value>137</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PA10</name>
                  <description>Port A, Pin10</description>
                  <value>138</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PA11</name>
                  <description>Port A, Pin11</description>
                  <value>139</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PA12</name>
                  <description>Port A, Pin12</description>
                  <value>140</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PA13</name>
                  <description>Port A, Pin13</description>
                  <value>141</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PA14</name>
                  <description>Port A, Pin14</description>
                  <value>142</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PA15</name>
                  <description>Port A, Pin15</description>
                  <value>143</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PB0</name>
                  <description>Port B, Pin0</description>
                  <value>144</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PB1</name>
                  <description>Port B, Pin1</description>
                  <value>145</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PB2</name>
                  <description>Port B, Pin2</description>
                  <value>146</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PB3</name>
                  <description>Port B, Pin3</description>
                  <value>147</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PB4</name>
                  <description>Port B, Pin4</description>
                  <value>148</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PB5</name>
                  <description>Port B, Pin5</description>
                  <value>149</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PB6</name>
                  <description>Port B, Pin6</description>
                  <value>150</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PB7</name>
                  <description>Port B, Pin7</description>
                  <value>151</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PB8</name>
                  <description>Port B, Pin8</description>
                  <value>152</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PB9</name>
                  <description>Port B, Pin9</description>
                  <value>153</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PB10</name>
                  <description>Port B, Pin10</description>
                  <value>154</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PB11</name>
                  <description>Port B, Pin11</description>
                  <value>155</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PB12</name>
                  <description>Port B, Pin12</description>
                  <value>156</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PB13</name>
                  <description>Port B, Pin13</description>
                  <value>157</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PB14</name>
                  <description>Port B, Pin14</description>
                  <value>158</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PB15</name>
                  <description>Port B, Pin15</description>
                  <value>159</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PC0</name>
                  <description>Port C, Pin0</description>
                  <value>160</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PC1</name>
                  <description>Port C, Pin1</description>
                  <value>161</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PC2</name>
                  <description>Port C, Pin2</description>
                  <value>162</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PC3</name>
                  <description>Port C, Pin3</description>
                  <value>163</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PC4</name>
                  <description>Port C, Pin4</description>
                  <value>164</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PC5</name>
                  <description>Port C, Pin5</description>
                  <value>165</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PC6</name>
                  <description>Port C, Pin6</description>
                  <value>166</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PC7</name>
                  <description>Port C, Pin7</description>
                  <value>167</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PC8</name>
                  <description>Port C, Pin8</description>
                  <value>168</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PC9</name>
                  <description>Port C, Pin9</description>
                  <value>169</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PC10</name>
                  <description>Port C, Pin10</description>
                  <value>170</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PC11</name>
                  <description>Port C, Pin11</description>
                  <value>171</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PC12</name>
                  <description>Port C, Pin12</description>
                  <value>172</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PC13</name>
                  <description>Port C, Pin13</description>
                  <value>173</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PC14</name>
                  <description>Port C, Pin14</description>
                  <value>174</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PC15</name>
                  <description>Port C, Pin15</description>
                  <value>175</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PD0</name>
                  <description>Port D, Pin0</description>
                  <value>176</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PD1</name>
                  <description>Port D, Pin1</description>
                  <value>177</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PD2</name>
                  <description>Port D, Pin2</description>
                  <value>178</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PD3</name>
                  <description>Port D, Pin3</description>
                  <value>179</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PD4</name>
                  <description>Port D, Pin4</description>
                  <value>180</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PD5</name>
                  <description>Port D, Pin5</description>
                  <value>181</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PD6</name>
                  <description>Port D, Pin6</description>
                  <value>182</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PD7</name>
                  <description>Port D, Pin7</description>
                  <value>183</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PD8</name>
                  <description>Port D, Pin8</description>
                  <value>184</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PD9</name>
                  <description>Port D, Pin9</description>
                  <value>185</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PD10</name>
                  <description>Port D, Pin10</description>
                  <value>186</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PD11</name>
                  <description>Port D, Pin11</description>
                  <value>187</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PD12</name>
                  <description>Port D, Pin12</description>
                  <value>188</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PD13</name>
                  <description>Port D, Pin13</description>
                  <value>189</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PD14</name>
                  <description>Port D, Pin14</description>
                  <value>190</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PD15</name>
                  <description>Port D, Pin15</description>
                  <value>191</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NEGSEL</name>
              <description>Negative Input Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VSS</name>
                  <description>VSS</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VREFDIVAVDD</name>
                  <description>Divided AVDD</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VREFDIVAVDDLP</name>
                  <description>Low-Power Divided AVDD</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VREFDIV1V25</name>
                  <description>Divided 1V25 reference</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VREFDIV1V25LP</name>
                  <description>Low-power Divided 1V25 reference</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VREFDIV2V5</name>
                  <description>Divided 2V5 reference</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VREFDIV2V5LP</name>
                  <description>Low-power Divided 2V5 reference</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSENSE01DIV4</name>
                  <description>VSENSE0 divided by 4</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSENSE01DIV4LP</name>
                  <description>Low-power VSENSE0 divided by 4</description>
                  <value>33</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSENSE11DIV4</name>
                  <description>VSENSE1 divided by 4</description>
                  <value>34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSENSE11DIV4LP</name>
                  <description>Low-power VSENSE1 divided by 4</description>
                  <value>35</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPSENSE</name>
                  <description>Capsense mode</description>
                  <value>48</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDAC0OUT0</name>
                  <description>VDAC0 channel 0 output</description>
                  <value>64</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDAC1OUT0</name>
                  <description>VDAC1 channel 0 output</description>
                  <value>66</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PA0</name>
                  <description>Port A, Pin0</description>
                  <value>128</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PA1</name>
                  <description>Port A, Pin1</description>
                  <value>129</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PA2</name>
                  <description>Port A, Pin2</description>
                  <value>130</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PA3</name>
                  <description>Port A, Pin3</description>
                  <value>131</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PA4</name>
                  <description>Port A, Pin4</description>
                  <value>132</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PA5</name>
                  <description>Port A, Pin5</description>
                  <value>133</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PA6</name>
                  <description>Port A, Pin6</description>
                  <value>134</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PA7</name>
                  <description>Port A, Pin7</description>
                  <value>135</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PA8</name>
                  <description>Port A, Pin8</description>
                  <value>136</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PA9</name>
                  <description>Port A, Pin9</description>
                  <value>137</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PA10</name>
                  <description>Port A, Pin10</description>
                  <value>138</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PA11</name>
                  <description>Port A, Pin11</description>
                  <value>139</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PA12</name>
                  <description>Port A, Pin12</description>
                  <value>140</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PA13</name>
                  <description>Port A, Pin13</description>
                  <value>141</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PA14</name>
                  <description>Port A, Pin14</description>
                  <value>142</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PA15</name>
                  <description>Port A, Pin15</description>
                  <value>143</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PB0</name>
                  <description>Port B, Pin0</description>
                  <value>144</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PB1</name>
                  <description>Port B, Pin1</description>
                  <value>145</value>
                </enumeratedValue>
